Tekla Open API Reference for Tekla Structures 2025
Solid.Intersect Method (Point, Point)
 Returns a list of line - solid intersection points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Intersect(
	Point point1,
	Point point2
)
Public Function Intersect (
	point1 As Point,
	point2 As Point
) As ArrayList
Parameters
point1
Type: Tekla.Structures.Geometry3d.Point
The first end of the intersection line.
point2
Type: Tekla.Structures.Geometry3d.Point
The second end of the intersection line.
Return Value
Type: ArrayList
A list of intersection points.
See Also
Reference
Solid Class
Intersect Overload
Tekla.Structures.Model Namespace